# компьютеру Марк-1 90-12=78 лет
n = input("Здравствуйте! Как Вас зовут? ")
print(f"Очень приятно, {n}! Меня зовут Марк.")
a = int(input("Сколько Вам лет? "))
if a < 78:
    d = 78 - a
    print(f"Да, {n}, я старше Вас на {d} лет.")
else:
    d = a - 78
    print(f"Да, {n}, Вы старше меня на {d} лет.")
p = input("Вам нравится программировать? ")
if p == "да":
    print("Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.")
else:
    print("Жаль. Я думал, Вы сможете написать интересную программу для меня.")